sterentev/atdf-device-asm-include/inc/ATmega2561.inc
; ----------	Register GTCCR bits		------------------------
.equ	TSM		= 7		; 0x80 - Timer/Counter Synchronization Mode
.equ	PSRSYNC		= 0		; 0x01 - Prescaler Reset Timer/Counter1 and Timer/Counter0



; ====	TC8_ASYNC MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register TIMSK2 bits		------------------------
.equ	OCIE2B		= 2		; 0x04 - Timer/Counter2 Output Compare Match B Interrupt Enable
.equ	OCIE2A		= 1		; 0x02 - Timer/Counter2 Output Compare Match A Interrupt Enable
.equ	TOIE2		= 0		; 0x01 - Timer/Counter2 Overflow Interrupt Enable

; ----------	Register TIFR2 bits		------------------------
.equ	OCF2B		= 2		; 0x04 - Output Compare Flag 2B
.equ	OCF2A		= 1		; 0x02 - Output Compare Flag 2A
.equ	TOV2		= 0		; 0x01 - Timer/Counter2 Overflow Flag

; ----------	Register TCCR2A bits		------------------------
.equ	COM2A_MASK	= 0xC0		;      - Compare Output Mode bits (2 bits)
.equ	COM2A0		= 6		;          COM2A BIT0 position
.equ	COM2B_MASK	= 0x30		;      - Compare Output Mode bits (2 bits)
.equ	COM2B0		= 4		;          COM2B BIT0 position
.equ	WGM2_MASK	= 0x03		;      - Waveform Generation Mode (2 bits)
.equ	WGM20		= 0		;          WGM2 BIT0 position

; ----------	Register TCCR2B bits		------------------------
.equ	FOC2A		= 7		; 0x80 - Force Output Compare A
.equ	FOC2B		= 6		; 0x40 - Force Output Compare B
.equ	WGM22		= 3		; 0x08 - Waveform Generation Mode
.equ	CS2_MASK	= 0x07		;      - Clock Select bits (3 bits)
.equ	CS20		= 0		;          CS2 BIT0 position
; ::::  CS2	:::: bitfield values
;			0x00		; No Clock Source (Stopped)
;			0x01		; Running, No Prescaling
;			0x02		; Running, CLK/8
;			0x03		; Running, CLK/32
;			0x04		; Running, CLK/64
;			0x05		; Running, CLK/128
;			0x06		; Running, CLK/256
;			0x07		; Running, CLK/1024

; ----------	Register ASSR bits		------------------------
.equ	EXCLK		= 6		; 0x40 - Enable External Clock Input
.equ	AS2		= 5		; 0x20 - Asynchronous Timer/Counter2
.equ	TCN2UB		= 4		; 0x10 - Timer/Counter2 Update Busy
.equ	OCR2AUB		= 3		; 0x08 - Output Compare Register2 Update Busy
.equ	OCR2BUB		= 2		; 0x04 - Output Compare Register 2 Update Busy
.equ	TCR2AUB		= 1		; 0x02 - Timer/Counter Control Register2 Update Busy
.equ	TCR2BUB		= 0		; 0x01 - Timer/Counter Control Register2 Update Busy

; ----------	Register GTCCR bits		------------------------
;.equ	TSM		= 7		; 0x80 - Timer/Counter Synchronization Mode
.equ	PSRASY		= 1		; 0x02 - Prescaler Reset Timer/Counter2



; ====	WDT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register WDTCSR bits		------------------------
.equ	WDIF		= 7		; 0x80 - Watchdog Timeout Interrupt Flag
.equ	WDIE		= 6		; 0x40 - Watchdog Timeout Interrupt Enable
.equ	WDP_MASK	= 0x27		;      - Watchdog Timer Prescaler Bits (4 bits)
.equ	WDCE		= 4		; 0x10 - Watchdog Change Enable
.equ	WDE		= 3		; 0x08 - Watch Dog Enable
; ::::  WDP	:::: bitfield values
;			0x00		; Oscillator Cycles 2K
;			0x01		; Oscillator Cycles 4K
;			0x02		; Oscillator Cycles 8K
;			0x03		; Oscillator Cycles 16K
;			0x04		; Oscillator Cycles 32K
;			0x05		; Oscillator Cycles 64K
;			0x06		; Oscillator Cycles 128K
;			0x07		; Oscillator Cycles 256K
;			0x20		; Oscillator Cycles 512K
;			0x21		; Oscillator Cycles 1024K



; ====	EEPROM MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register EECR bits		------------------------
.equ	EEPM_MASK	= 0x30		;      - EEPROM Programming Mode Bits (2 bits)
.equ	EEPM0		= 4		;          EEPM BIT0 position
.equ	EERIE		= 3		; 0x08 - EEPROM Ready Interrupt Enable
.equ	EEMPE		= 2		; 0x04 - EEPROM Master Write Enable
.equ	EEPE		= 1		; 0x02 - EEPROM Write Enable
.equ	EERE		= 0		; 0x01 - EEPROM Read Enable
; ::::  EEPM	:::: bitfield values
;			0x00		; Erase and Write in one operation
;			0x10		; Erase Only
;			0x20		; Write Only



; ====	TC16 MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register TCCR5A bits		------------------------
.equ	COM5A_MASK	= 0xC0		;      - Compare Output Mode 1A, bits (2 bits)
.equ	COM5A0		= 6		;          COM5A BIT0 position
.equ	COM5B_MASK	= 0x30		;      - Compare Output Mode 5B, bits (2 bits)
.equ	COM5B0		= 4		;          COM5B BIT0 position
.equ	COM5C_MASK	= 0x0C		;      - Compare Output Mode 5C, bits (2 bits)
.equ	COM5C0		= 2		;          COM5C BIT0 position
.equ	TCCR5A_WGM5_MASK= 0x03		;      - Waveform Generation Mode (2 bits)
.equ	TCCR5A_WGM50	= 0		;          TCCR5A_WGM5 BIT0 position

; ----------	Register TCCR5B bits		------------------------
.equ	ICNC5		= 7		; 0x80 - Input Capture 5 Noise Canceler
.equ	ICES5		= 6		; 0x40 - Input Capture 5 Edge Select
.equ	TCCR5B_WGM5_MASK= 0x18		;      - Waveform Generation Mode (2 bits)
.equ	TCCR5B_WGM50	= 3		;          TCCR5B_WGM5 BIT0 position
.equ	CS5_MASK	= 0x07		;      - Prescaler source of Timer/Counter 5 (3 bits)
.equ	CS50		= 0		;          CS5 BIT0 position
; ::::  CS5	:::: bitfield values
;			0x00		; No Clock Source (Stopped)
;			0x01		; Running, No Prescaling
;			0x02		; Running, CLK/8
;			0x03		; Running, CLK/64
;			0x04		; Running, CLK/256
;			0x05		; Running, CLK/1024
;			0x06		; Running, ExtClk Tn Falling Edge
;			0x07		; Running, ExtClk Tn Rising Edge

; ----------	Register TCCR5C bits		------------------------
.equ	FOC5A		= 7		; 0x80 - Force Output Compare 5A
.equ	FOC5B		= 6		; 0x40 - Force Output Compare 5B
.equ	FOC5C		= 5		; 0x20 - Force Output Compare 5C

; ----------	Register TIMSK5 bits		------------------------
.equ	ICIE5		= 5		; 0x20 - Timer/Counter5 Input Capture Interrupt Enable
.equ	OCIE5C		= 3		; 0x08 - Timer/Counter5 Output Compare C Match Interrupt Enable
.equ	OCIE5B		= 2		; 0x04 - Timer/Counter5 Output Compare B Match Interrupt Enable
.equ	OCIE5A		= 1		; 0x02 - Timer/Counter5 Output Compare A Match Interrupt Enable
.equ	TOIE5		= 0		; 0x01 - Timer/Counter5 Overflow Interrupt Enable

; ----------	Register TIFR5 bits		------------------------
.equ	ICF5		= 5		; 0x20 - Input Capture Flag 5
.equ	OCF5C		= 3		; 0x08 - Output Compare Flag 5C
.equ	OCF5B		= 2		; 0x04 - Output Compare Flag 5B
.equ	OCF5A		= 1		; 0x02 - Output Compare Flag 5A
.equ	TOV5		= 0		; 0x01 - Timer/Counter5 Overflow Flag

; ----------	Register TCCR4A bits		------------------------
.equ	COM4A_MASK	= 0xC0		;      - Compare Output Mode 1A, bits (2 bits)
.equ	COM4A0		= 6		;          COM4A BIT0 position
.equ	COM4B_MASK	= 0x30		;      - Compare Output Mode 4B, bits (2 bits)
.equ	COM4B0		= 4		;          COM4B BIT0 position
.equ	COM4C_MASK	= 0x0C		;      - Compare Output Mode 4C, bits (2 bits)
.equ	COM4C0		= 2		;          COM4C BIT0 position
.equ	TCCR4A_WGM4_MASK= 0x03		;      - Waveform Generation Mode (2 bits)
.equ	TCCR4A_WGM40	= 0		;          TCCR4A_WGM4 BIT0 position

; ----------	Register TCCR4B bits		------------------------
.equ	ICNC4		= 7		; 0x80 - Input Capture 4 Noise Canceler
.equ	ICES4		= 6		; 0x40 - Input Capture 4 Edge Select
.equ	TCCR4B_WGM4_MASK= 0x18		;      - Waveform Generation Mode (2 bits)
.equ	TCCR4B_WGM40	= 3		;          TCCR4B_WGM4 BIT0 position
.equ	CS4_MASK	= 0x07		;      - Prescaler source of Timer/Counter 4 (3 bits)
.equ	CS40		= 0		;          CS4 BIT0 position
; ::::  CS4	:::: bitfield values
;			0x00		; No Clock Source (Stopped)
;			0x01		; Running, No Prescaling
;			0x02		; Running, CLK/8
;			0x03		; Running, CLK/64
;			0x04		; Running, CLK/256
;			0x05		; Running, CLK/1024
;			0x06		; Running, ExtClk Tn Falling Edge
;			0x07		; Running, ExtClk Tn Rising Edge

; ----------	Register TCCR4C bits		------------------------
.equ	FOC4A		= 7		; 0x80 - Force Output Compare 4A
.equ	FOC4B		= 6		; 0x40 - Force Output Compare 4B
.equ	FOC4C		= 5		; 0x20 - Force Output Compare 4C

; ----------	Register TIMSK4 bits		------------------------
.equ	ICIE4		= 5		; 0x20 - Timer/Counter4 Input Capture Interrupt Enable
.equ	OCIE4C		= 3		; 0x08 - Timer/Counter4 Output Compare C Match Interrupt Enable
.equ	OCIE4B		= 2		; 0x04 - Timer/Counter4 Output Compare B Match Interrupt Enable
.equ	OCIE4A		= 1		; 0x02 - Timer/Counter4 Output Compare A Match Interrupt Enable
.equ	TOIE4		= 0		; 0x01 - Timer/Counter4 Overflow Interrupt Enable

