sterentev/atdf-device-asm-include/inc/ATmega2561.inc
; **********************************************************************
; ***************	EXTRA BITFIELDS VALUES	************************
; **********************************************************************
;
; ::::  COMM_SCK_RATE_3BIT	:::: values
;			0b000		; fosc/4
;			0b001		; fosc/16
;			0b010		; fosc/64
;			0b011		; fosc/128
;			0b100		; fosc/2
;			0b101		; fosc/8
;			0b110		; fosc/32
;			0b111		; fosc/64
; ::::  ADC_MUX_DIFF6	:::: values
;			0b000000	; ADC Single Ended Input pin 0
;			0b000001	; ADC Single Ended Input pin 1
;			0b000010	; ADC Single Ended Input pin 2
;			0b000011	; ADC Single Ended Input pin 3
;			0b000100	; ADC Single Ended Input pin 4
;			0b000101	; ADC Single Ended Input pin 5
;			0b000110	; ADC Single Ended Input pin 6
;			0b000111	; ADC Single Ended Input pin 7
;			0b001000	; ADC Differential Inputs Positive pin 0 Negative pin 0 10x Gain
;			0b001001	; ADC Differential Inputs Positive pin 1 Negative pin 0 10x Gain
;			0b001010	; ADC Differential Inputs Positive pin 0 Negative pin 0 200x Gain
;			0b001011	; ADC Differential Inputs Positive pin 1 Negative pin 0 200x Gain
;			0b001100	; ADC Differential Inputs Positive pin 2 Negative pin 2 10x Gain
;			0b001101	; ADC Differential Inputs Positive pin 3 Negative pin 2 10x Gain
;			0b001110	; ADC Differential Inputs Positive pin 2 Negative pin 2 200x Gain
;			0b001111	; ADC Differential Inputs Positive pin 3 Negative pin 2 200x Gain
;			0b010000	; ADC Differential Inputs Positive pin 0 Negative pin 1 1x Gain
;			0b010001	; ADC Differential Inputs Positive pin 1 Negative pin 1 1x Gain
;			0b010010	; ADC Differential Inputs Positive pin 2 Negative pin 1 1x Gain
;			0b010011	; ADC Differential Inputs Positive pin 3 Negative pin 1 1x Gain
;			0b010100	; ADC Differential Inputs Positive pin 4 Negative pin 1 1x Gain
;			0b010101	; ADC Differential Inputs Positive pin 5 Negative pin 1 1x Gain
;			0b010110	; ADC Differential Inputs Positive pin 6 Negative pin 1 1x Gain
;			0b010111	; ADC Differential Inputs Positive pin 7 Negative pin 1 1x Gain
;			0b011000	; ADC Differential Inputs Positive pin 0 Negative pin 2 1x Gain
;			0b011001	; ADC Differential Inputs Positive pin 1 Negative pin 2 1x Gain
;			0b011010	; ADC Differential Inputs Positive pin 2 Negative pin 2 1x Gain
;			0b011011	; ADC Differential Inputs Positive pin 3 Negative pin 2 1x Gain
;			0b011100	; ADC Differential Inputs Positive pin 4 Negative pin 2 1x Gain
;			0b011101	; ADC Differential Inputs Positive pin 5 Negative pin 2 1x Gain
;			0b011110	; Internal Reference (VBG)
;			0b011111	; 0V (GND)
;			0b100000	; ADC Single Ended Input pin 8
;			0b100001	; ADC Single Ended Input pin 9
;			0b100010	; ADC Single Ended Input pin 10
;			0b100011	; ADC Single Ended Input pin 11
;			0b100100	; ADC Single Ended Input pin 12
;			0b100101	; ADC Single Ended Input pin 13
;			0b100110	; ADC Single Ended Input pin 14
;			0b100111	; ADC Single Ended Input pin 15
;			0b101000	; ADC Differential Inputs Positive pin 8 Negative pin 8 10x Gain
;			0b101001	; ADC Differential Inputs Positive pin 9 Negative pin 8 10x Gain
;			0b101010	; ADC Differential Inputs Positive pin 8 Negative pin 8 200x Gain
;			0b101011	; ADC Differential Inputs Positive pin 9 Negative pin 8 200x Gain
;			0b101100	; ADC Differential Inputs Positive pin 10 Negative pin 10 10x Gain
;			0b101101	; ADC Differential Inputs Positive pin 11 Negative pin 10 10x Gain
;			0b101110	; ADC Differential Inputs Positive pin 10 Negative pin 10 200x Gain
;			0b101111	; ADC Differential Inputs Positive pin 11 Negative pin 10 200x Gain
;			0b110000	; ADC Differential Inputs Positive pin 8 Negative pin 9 1x Gain
;			0b110001	; ADC Differential Inputs Positive pin 9 Negative pin 9 1x Gain
;			0b110010	; ADC Differential Inputs Positive pin 10 Negative pin 9 1x Gain
;			0b110011	; ADC Differential Inputs Positive pin 11 Negative pin 9 1x Gain
;			0b110100	; ADC Differential Inputs Positive pin 12 Negative pin 9 1x Gain
;			0b110101	; ADC Differential Inputs Positive pin 13 Negative pin 9 1x Gain
;			0b110110	; ADC Differential Inputs Positive pin 14 Negative pin 9 1x Gain
;			0b110111	; ADC Differential Inputs Positive pin 15 Negative pin 9 1x Gain
;			0b111000	; ADC Differential Inputs Positive pin 8 Negative pin 10 1x Gain
;			0b111001	; ADC Differential Inputs Positive pin 9 Negative pin 10 1x Gain
;			0b111010	; ADC Differential Inputs Positive pin 10 Negative pin 10 1x Gain
;			0b111011	; ADC Differential Inputs Positive pin 11 Negative pin 10 1x Gain
;			0b111100	; ADC Differential Inputs Positive pin 12 Negative pin 10 1x Gain
;			0b111101	; ADC Differential Inputs Positive pin 13 Negative pin 10 1x Gain



; **********************************************************************
; ***************	INTERRUPT VECTORS	************************
; **********************************************************************
;
.equ	INT_VECTORS_NUM		= 57
.equ	INT_VECTORS_SIZE	= 0x72
;
; ----------	INTERRUPT INDEXES		------------------------
;
;	0	RESET		; External Pin,Power-on Reset,Brown-out Reset,Watchdog Reset,and JTAG AVR Reset. See Datasheet.     
;	1	INT0		; External Interrupt Request 0
;	2	INT1		; External Interrupt Request 1
;	3	INT2		; External Interrupt Request 2
;	4	INT3		; External Interrupt Request 3
;	5	INT4		; External Interrupt Request 4
;	6	INT5		; External Interrupt Request 5
;	7	INT6		; External Interrupt Request 6
;	8	INT7		; External Interrupt Request 7
;	9	PCINT0		; Pin Change Interrupt Request 0
;	10	PCINT1		; Pin Change Interrupt Request 1
;	11	PCINT2		; Pin Change Interrupt Request 2
;	12	WDT		; Watchdog Time-out Interrupt
;	13	TIMER2_COMPA	; Timer/Counter2 Compare Match A
;	14	TIMER2_COMPB	; Timer/Counter2 Compare Match B
;	15	TIMER2_OVF	; Timer/Counter2 Overflow
;	16	TIMER1_CAPT	; Timer/Counter1 Capture Event
;	17	TIMER1_COMPA	; Timer/Counter1 Compare Match A
;	18	TIMER1_COMPB	; Timer/Counter1 Compare Match B
;	19	TIMER1_COMPC	; Timer/Counter1 Compare Match C
;	20	TIMER1_OVF	; Timer/Counter1 Overflow
;	21	TIMER0_COMPA	; Timer/Counter0 Compare Match A
;	22	TIMER0_COMPB	; Timer/Counter0 Compare Match B
;	23	TIMER0_OVF	; Timer/Counter0 Overflow
;	24	SPI_STC		; SPI Serial Transfer Complete
;	25	USART0_RX	; USART0, Rx Complete
;	26	USART0_UDRE	; USART0 Data register Empty
;	27	USART0_TX	; USART0, Tx Complete
;	28	ANALOG_COMP	; Analog Comparator
;	29	ADC		; ADC Conversion Complete
;	30	EE_READY	; EEPROM Ready
;	31	TIMER3_CAPT	; Timer/Counter3 Capture Event
;	32	TIMER3_COMPA	; Timer/Counter3 Compare Match A
;	33	TIMER3_COMPB	; Timer/Counter3 Compare Match B
;	34	TIMER3_COMPC	; Timer/Counter3 Compare Match C
;	35	TIMER3_OVF	; Timer/Counter3 Overflow
;	36	USART1_RX	; USART1, Rx Complete
;	37	USART1_UDRE	; USART1 Data register Empty
;	38	USART1_TX	; USART1, Tx Complete
;	39	TWI		; 2-wire Serial Interface
;	40	SPM_READY	; Store Program Memory Read
;	41	TIMER4_CAPT	; Timer/Counter4 Capture Event
;	42	TIMER4_COMPA	; Timer/Counter4 Compare Match A
;	43	TIMER4_COMPB	; Timer/Counter4 Compare Match B
;	44	TIMER4_COMPC	; Timer/Counter4 Compare Match C
;	45	TIMER4_OVF	; Timer/Counter4 Overflow
;	46	TIMER5_CAPT	; Timer/Counter5 Capture Event
;	47	TIMER5_COMPA	; Timer/Counter5 Compare Match A
;	48	TIMER5_COMPB	; Timer/Counter5 Compare Match B
;	49	TIMER5_COMPC	; Timer/Counter5 Compare Match C
;	50	TIMER5_OVF	; Timer/Counter5 Overflow
;	51	USART2_RX	; USART2, Rx Complete
;	52	USART2_UDRE	; USART2 Data register Empty
;	53	USART2_TX	; USART2, Tx Complete
;	54	USART3_RX	; USART3, Rx Complete
;	55	USART3_UDRE	; USART3 Data register Empty
;	56	USART3_TX	; USART3, Tx Complete


